Case_file_CDCC/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  Bottom
  {
    type            fixedValue;
    value           uniform (0 -0.001 0);
  }
  Top
  {
      type            pressureInletOutletVelocity;
      value           uniform (0 -0.001 0);
  }

  "(condWall|convWall|htopWall)"
  {
    type            slip;
  }
  LSymm
  {
      type            symmetryPlane;
  }

}

// ************************************************************************* //
