Case_file_CDCC/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    Top
    {
        type            patch;
        nFaces          25;
        startFace       15486;
    }
    Bottom
    {
        type            patch;
        nFaces          29;
        startFace       15511;
    }
    htopWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       15540;
    }
    condWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5;
        startFace       15560;
    }
    convWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       15565;
    }
    LSymm
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          275;
        startFace       15815;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15790;
        startFace       16090;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4;
        startFace       31880;
    }
)

// ************************************************************************* //
