Case_file_CDCC/constant/thermoProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//-- Phase Diagram Information
Tmelt	[0 0 0 1 0 0 0]   923.65;
Teut	[0 0 0 1 0 0 0]   654.15;
Tiso    [0 0 0 1 0 0 0]   0.5;

Calpha	[0 0 0 0 0 0 0]   0.032;
Ceut    [0 0 0 0 0 0 0]   0.94;

L       [0 2 -2 0 0 0 0]  3.76e5;

// ************************************************************************* //
