Case_file_CDCC/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;
        maxIter         100;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(T|C|U)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    "(T|C|U)Final"
    {
        $T;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     1;
    nOuterCorrectors    1;
    nNonOrthogonalCorrectors 0;

    pRefCell        0;
    pRefValue       0;

    nThermoCorr     10;
}

relaxationFactors
{
    equations
    {
        ".*"   1.0;
    }
}


// ************************************************************************* //
